---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ConduitSize
source: html/4271b827-6390-ab67-036a-305101a712b5.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSize

Stores the basic size information for a conduit.

## Syntax (C#)
```csharp
public class ConduitSize : IDisposable
```